app/controllers/categories_controller.rb

  def new
    @category = Category.new
    @products = Product.all
---
SELECT "products".* FROM "products"

  def edit
    @products = Product.all
---
SELECT "products".* FROM "products"