app/controllers/products_controller.rb

  def index
    @products = Product.all.order('created_at DESC')
---
SELECT "products".* FROM "products" ORDER BY created_at DESC

  def new
    @product = Product.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "fdha"], ["description", "fdjkal;"], ["created_at", "2018-03-20 14:16:29.521898"], ["updated_at", "2018-03-20 14:16:29.521898"]]